//import {rerenderUI} from "../index";
// const ADD_EXIRCISE = 'ADD_EXIRCISE';
// const CHANGE_INPUT = 'CHANGE_INPUT';


import trainingReducer, {ADD_EXIRCISE, CHANGE_INPUT} from "./training-reducer";
import articlesReducer from "./articles-reducer";
import sidebarReducer from "./sidebar-reducer";

const GET_ARTICLE = 'GET_ARTICLE';

const text1 = 'Здатність тварин до  довільного руху надала їм надзвичайні можливості для пристосування до умов зовнішнього середовища. Рухова дія була реакцією на зовнішній подразник або потребу.\n' +
    'Впродовж тисячоліть  існування людства як біологічного виду  рухова активність була необхідною умовою виживання та існування . Завдяки м’язовим скороченням відбувалось переміщення ланок тіла одна відносно іншої та тіла в просторі.  Але крім  прямого ефекту – руху, м’язові скорочення створювали також і побічні, такі як  |зворотній нервовий зв\'язок з мозком що  впливало на мозкову діяльність,  /утворення продуктів розпаду   речовин що забезпечують енергію для скорочення м\'язів та інші .\n' +
    'Розглядаючи тему – рух  як біологічна потреба організму неможна оминути тему здоров’я.  Важливою складовою біологічного здоров’я є сталість внутрішнього середовища організму, адже функціонувати організм може лише за певного рівня таких параметрів організму як  тиск, хімічний склад крові, температура тіла та ін. Оскільки фактори зовнішнього і внутрішнього  середовища постійно змінюються то найважливішим завданням функцій органів і систем є опірність цим впливам. \n' +
    'Отже рухова активність була складовою складного комплексу підтримки сталості внутрішнього середовища організму.  Наприклад візьмемо стресову ситуацію надниркові залози у таких випадках рефлекторно  викидають в кров адреналін, мобілізуючи таким чином організм до атаки, захисту чи втечі. В процесі рухової активності що виникла як реакція на небезпеку  адреналін утилізується з крові. А тепер уявимо аналогічну ситуацію в цивілізовану середовищі. Водій за кермом потрапляє у аварійну ситуацію,  аварії вдалось уникнути,  організм мобілізований готовий до руху, але рухової розрядки не відбувається  якщо такі ситуації трапляються часто це прямий шлях до різного роду нервових розладів.\n';




let store = {

  _state: {

    articlesData: {

      articlesSet: [
        {id: 0, title: 'Вступ', description: 'Всім відомо що рухова активність ...', content: text1,},
        {id: 1, title: 'Рух це життя', description: 'З давних давен для виживання ...'}
      ]
    },

    trainingData: {

      exirsiseSet: [
        {id: 0, title: 'Присідання', text: '1 - присід, руки перед собою, 2 - вихідне положення ...'}
      ],
      newExirciseText: 'flipY',
    },

    sidebarData: {

      currentRoute: '',

    }
  },


  getState() {
    return this._state;
  },

  _rerenderUI() {
    console.log('rerenderUI w');
  },

  dispatch(action) {
    this._state.trainingData = trainingReducer(this._state.trainingData, action);
    this._state.articlesData = articlesReducer(this._state.articlesData, action);
    this._state.sidebarData = sidebarReducer(this._state.sidebarData, action);
    this._rerenderUI(this._state);
  },



  subscribe(observer) {
    this._rerenderUI = observer;
  },

}


export default store;