import React, { Component } from 'react';
import classes from '../styles/MainSection.module.css';

export default class Home extends Component {
    constructor(props) {
        super(props);
    }

    render() {
        return (

                <div className={classes.maincontent}>
                    {/*<h2> {this.props.title}</h2>*/}
                  <h2>Home</h2>
                  <span>
                    Культура в перекладі з латини  означає обробіток, створення чогось або результат цієї дії.
 Фізична – означає матеріальна складова людини, тобто тіло. Отже фізична культура  це здобутки
 людства у сфері  створення тіла. Якщо відкоригувати це визначення то отримаємо – фізична культура
 це  комплекс здобутків людства у сфері вдосконалення форм і функцій тіла, організованої засобами педагогіки.
 Фізичне виховання - це педагогічний процес націлений на розвиток форм і функцій тіла.  Основним специфічним
 засобом фізичного виховання  є фізичні вправи. Фізичні вправи це  рухи та їх комплекси спеціально підібрані
 для впливу на певні частини тіла та його функції. Спорт – є складовою частиною  фізичної культури, і являє  о
рганізовану  діяльність людей, що полягає в зіставленні їх фізичних та інтелектуальних здібностей у формі змагань,
 а також підготовку до цієї діяльності.
                  </span>
                </div>
        );
    }
}